// 6. Користувач вводить три довжини сторін трикутника
// (використовуйте prompt () три рази для введення кожної сторони).
// Необхідно
// a) визначити і вивести в консоль площу трикутника
// b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
//     Здійснювати перевірку чи введені користувачем значення коректні,
//     в іншому випадку вивести
// 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми ' +
// '(наприклад:  8.42355465 =>  8.424).

//Користувач вводить три довжини сторін трикутника
let a = Number(prompt("Please, enter length A value"));
let b = Number(prompt("Please, enter length B value"));
let c = Number(prompt("Please, enter length C value"));


// Здійснювати перевірку чи введені користувачем значення коректні
//трикутник існує тільки тоді, коли сума будь-яких двох його сторін більше третьої сторони
// + сторона не може бути менше 0
if (a <= 0 || b <= 0 || c <= 0 || a + b < c || b + c < a || c + a < b)
    alert("Incorrect data");

// a) визначити і вивести в консоль площу трикутника.Результат обчислення з точністю 3 знаки після коми
let p = (a + b + c) / 2;
let s = Math.sqrt(p * (p - a) * (p - b) * (p - c));
console.log("Area of the triangle is: " + s.toFixed(3));

// b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
// Теорема Піфагора
let hypotenuse;
let side1;
let side2;

if (a > b && a > c) {
    hypotenuse = a;
    side1 = b;
    side2 = c;
} else if (b > a && b > c) {
    hypotenuse = b;
    side1 = a;
    side2 = c;
} else if (c > a && c > b) {
    hypotenuse = c;
    side1 = a;
    side2 = b;
}

let isRight = (hypotenuse * hypotenuse) === (side1 * side1) + (side2 * side2);
console.log("Is right: " + isRight);

