// 3. Створіть порожній масив;
// 1) У перший елемент масиву запишіть будь-яке число;
// 2) У другий елемент масиву запишіть будь-який рядок;
// 3) У третій елемент масиву запишіть будь-яке логічне значення;
// 4) У четвертий елемент масиву запишіть значення null;
// 5) Виведіть на екран число елементів, яке зберігається в масиві;
// 6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
// 7) Виведіть на екран п'ятий елемент масиву.
// 8) Видаліть 1-ий елемент масиву і виведіть масив на екран.

//1-4
let myArray = [];
myArray[0] = 77;
myArray[1] = "my_string_value";
myArray[2] = true;
myArray[3] = null;

//5
document.write(myArray.length + '<br>');

//6
myArray[4] = prompt("Please, enter your name");

// 7
document.write(myArray[4] + '<br>');

//8
myArray.shift();
document.write(myArray + '<br>');
